Repository: giochagelishvili/GiorgiChagelishvili
Catalog: PizzaProject/PizzaProject/PizzaProject.API/Infrastructure/Localizations/ErrorMessages.*.resx
Languages: ka_ge

# AddressCityEmpty
source: City is required field.
ka_ge: ქალაქი არის აუცილებელი ველი.

# AddressCityLengthInvalid
source: City must be less than 16 symbols.
ka_ge: ქალაქის სახელი უნდა იყოს 16 სიმბოლოზე ნაკლები.

# AddressCountryEmpty
source: Country is required field.
ka_ge: ქვეყანა არის აუცილებელი ველი.

# AddressCountryLengthInvalid
source: Country must be less than 16 symbols.
ka_ge: ქვეყნის სახელი უნდა იყოს 16 სიმბოლოზე ნაკლები.

# AddressDescriptionLengthInvalid
source: Description must be less than 100 symbols.
ka_ge: მისამართის აღწერა უნდა იყოს 100 სიმბოლოზე ნაკლები.

# AddressDoesNotExist
source: Address does not exist for this user.
ka_ge: აღნიშნულ მომხმარებელს მსგავსი მისამართი არ აქვს.

# AddressNotFound
source: Couldn't find address.
ka_ge: მისამართი ვერ მოიძებნა.

# AddressRegionLengthInvalid
source: Region must be less than 16 symbols.
ka_ge: რეგიონის სახელი უნდა იყოს 16 სიმბოლოზე ნაკლები.

# AddressUserIdDoesNotExist
source: This user doesn't exist.
ka_ge: ასეთი მომხმარებელი არ არსებობს.

# EmailEmpty
source: Email is required field.
ka_ge: ელ. ფოსტა აუცილებელი ველია.

# EmailInvalid
source: Email is invalid.
ka_ge: ელ. ფოსტა არასწორია.

# InvalidRank
source: Rank must be from 1 to 10.
ka_ge: შეფასება უნდა იყოს 1-დან 10-ის ჩათვლით.

source: Order not found.
ka_ge: ასეთი შეკვეთა ვერ მოიძებნა.

# OrderPizzaListEmpty
source: Pizza list is required for creating order.
ka_ge: პიცების ჩამონათვალი საჭიროა შეკვეთის შესაქმნელად.

# OrderUserIdEmpty
source: User ID is required field.
ka_ge: მომხმარებლის აიდი სავალდებულო ველია.

# PizzaCaloryCountEmpty
source: Pizza calory count is a mandatory field.
ka_ge: კალორიულობა აუცილებელი ველია.

# PizzaCaloryCountInvalid
source: Calory count must be greater than 0.
ka_ge: კალორიულობა უნდა იყოს 0-ზე მეტი.

# PizzaInvalidDescriptionLength
source: Description must be less than 100 characters.
ka_ge: პიცის აღწერა უნდა იყოს 100 სიმბოლოზე ნაკლები.

# PizzaNameEmpty
source: Name is a mandatory field for pizza.
ka_ge: პიცის სახელი სავალდებულო ველია.

# PizzaNameInvalidLength
source: Pizza name must be at least 3 and maximum 20 symbols.
ka_ge: პიცის სახელი უნდა იყოს მინიმუმ 3 და მაქსიმუმ 20 სიმბოლო.

# PizzaNotFound
source: Couldn't find this pizza.
ka_ge: ასეთი პიცა ვერ მოიძებნა.

# PizzaPriceEmpty
source: Price is a mandatory field for pizza.
ka_ge: პიცის ფასი სავალდებულო ველია.

# PizzaPriceInvalid
source: Price must be greater than 0.
ka_ge: პიცის ფასი უნდა იყოს 0-ზე მეტი.

# RankHistoryInvalidPizzaId
source: This user has never ordered this pizza.
ka_ge: ამ მომხმარებელს ეს პიცა არასდროს შეუკვეთავს.

# RankHistoryPizzaIdRequired
source: Pizza ID is required to create rank history.
ka_ge: პიცის აიდი აუცილებელია შესაფასებლად.

# RankHistoryUserIdRequired
source: User ID is required for ranking.
ka_ge: მომხმარებელი აუცილებელი ველია.

# RankIsRequired
source: Rank is required field.
ka_ge: შეფასება აუცილებელი ველია.

source: Rank not found.
ka_ge: შეფასება ვერ მოიძებნა.

# UserFirstNameEmpty
source: First name is required field.
ka_ge: სახელი აუცილებელი ველია.

# UserFirstNameInvalidLength
source: First name should be at least 2 and maximum 20 characters.
ka_ge: სახელი უნდა შედგებოდეს მინიმუმ 2 და მაქსიმუმ 20 ასოსგან.

# UserLastNameEmpty
source: Last name is required field.
ka_ge: გვარი აუცილებელი ველია.

# UserLastNameInvalidLength
source: Last name should be at least 2 and maximum 30 characters.
ka_ge: გვარი უნდა შედგებოდეს მინიმუმ 2 და მაქსიმუმ 30 ასოსგან.

# UserNotFound
source: User ID not found.
ka_ge: ასეთი მომხმარებელი ვერ მოიძებნა.

# UserPhoneNumberEmpty
source: Phone number is required field.
ka_ge: ტელეფონის ნომერი აუცილებელი ველია.

# UserPhoneNumberInvalid
source: Phone number must contain 9 digits.
ka_ge: ტელეფონის ნომერი უნდა შედგებოდეს 9 ციფრისგან.
