Repository: giochagelishvili/GiorgiChagelishvili
Catalog: Forum.ItAcademy.Ge/Forum/Forum.Shared/Localizations/ErrorMessages.*.resx
Languages: ka_ge

# AllPasswordsRequired
source: All password fields should be filled in order to update the password.
ka_ge: პაროლის გასაახლებლად საჭიროა სამივე ველის შევსება.

# CommentBodyRequired
source: Comment body is a required field.
ka_ge: კომენტარის ტექსტი აუცილებელი ველია.

source: Comment not found.
ka_ge: კომენტარი ვერ მოიძებნა.

# ConfirmPasswordRequired
source: Confirm password is a required field.
ka_ge: პაროლის დადასტურება სავალდებულო ველია.

# DescriptionRequired
source: Description is a required field.
ka_ge: აღწერა აუცილებელი ველია.

# EmailAlreadyExists
source: User with this email already exists in the database.
ka_ge: ეს ელ. ფოსტა უკვე გამოყენებულია სხვა მომხმარებლის მიერ.

# EmailRequired
source: Email is a required field.
ka_ge: ელ. ფოსტა აუცილებელი ველია.

# EmptyBio
source: Bio should not be empty in order to be updated.
ka_ge: ბიო არ უნდა იყოს ცარიელი.

source: Image not found.
ka_ge: ფოტო ვერ მოიძებნა.

# InactiveTopic
source: New comments are not allowed on inactive topics.
ka_ge: არააქტიურ თემებზე ახალი კომენტარების დაწერა აკრძალულია.

# InvalidEmailFormat
source: Invalid email format, please try again.
ka_ge: ელ. ფოსტა არავალიდურია, გთხოვთ სცადოთ ხელახლა.

# InvalidFileExtension
source: This file is not supported. Valid files: ".jpg", ".png", ".jpeg", ".webp", ".ico".
ka_ge: ეს ფორმატი არავალიდურია. ვალიდური ფორმატები: ".jpg", ".png", ".jpeg", ".webp", ".ico".

# InvalidPassword
source: Invalid password, please try again.
ka_ge: პაროლი არასწორია, გთხოვთ სცადოთ ხელახლა.

# InvalidPasswordFormat
source: Password must be at least 6 characters long, must contain at least one digit, one symbol and uppercase letter.
ka_ge: პაროლი უნდა შეიცავდეს მინიმუმ 6 ასოს, ერთ სიმბოლოს, ერთ ციფრს და დიდ ასოს.

# InvalidState
source: Such state doesn't exist.
ka_ge: ასეთი მდგომარეობა არ არსებობს.

# InvalidStatus
source: Such status doesn't exist.
ka_ge: ასეთი სტატუსი არ არსებობს.

# NotEnoughComments
source: The user should have at least 3 comments written, in order to create a new topic.
ka_ge: მომხმარებელს დაწერილი უნდა ქონდეს მინიმუმ 3 კომენტარი იმისათვის, რომ შეეძლოს თემის შექმნა.

# OneFieldRequired
source: At least one field is required.
ka_ge: მინიმუმ ერთი ველი შევსებული უნდა იყოს.

source: Page not found.
ka_ge: ეს გვერდი ვერ მოიძებნა.

# PasswordMaxLength
source: Password must be less than 30 characters.
ka_ge: პაროლი უნდა შედგებოდეს მაქსიმუმ 30 სიმბოლოსგან.

# PasswordMinLength
source: Password must be more than 6 characters.
ka_ge: პაროლი უნდა შედგებოდეს მინიმუმ 6 სიმბოლოსგან.

# PasswordRequired
source: Password is a required field.
ka_ge: პაროლი აუცილებელი ველია.

# PasswordsDoNotMatch
source: Passwords do not match, please try again.
ka_ge: პაროლები არ ემთხვევა, გთხოვთ სცადოთ ხელახლა.

# TitleMaxLength
source: Title must be less than 50 characters.
ka_ge: სათაური უნდა შედგებოდეს მაქსიმუმ 50 სიმბოლოსგან.

# TitleRequired
source: Title is a required field.
ka_ge: სათაური აუცილებელი ველია.

# TopicIdRequired
source: Topic Id is a required field.
ka_ge: თემის აიდი აუცილებელი ველია.

source: Topic not found.
ka_ge: თემა ვერ მოიძებნა.

# Unauthorized
source: The user is unauthorized for this service.
ka_ge: მომხმარებლისთვის ეს სერვისი შეზღუდულია.

# UnhandledErrorOccurred
source: Unhandled error occurred, please try again later.
ka_ge: მოხდა დაუმუშავებელი შეცდომა, სცადეთ მოგვიანებით.

# UsernameAlreadyExists
source: Username already exists in the database.
ka_ge: მომხმარებლის სახელი უკვე დარეგისტრირებულია.

# UsernameMaxLength
source: Username must be less than 50 characters.
ka_ge: მომხმარებლის სახელი უნდა შედგებოდეს მაქსიმუმ 50 სიმბოლოსგან.

# UsernameRequired
source: Username is a required field.
ka_ge: მომხმარებლის სახელი აუცილებელი ველია.

source: User not found.
ka_ge: მომხმარებელი ვერ მოიძებნა.
